
// 注意事项！！！！！！！！！！！！！！！！！！！

// 1. 首先置信度不能乱调！！！！！！！！！适当调整很重要！！！！！
// 2. 取色的地方最好都取色了！！！！！！
// 3. 坐标不要乱调！！！！根据情况调整！！！！
// 4. 实在不会调整的话，找我







export const 配置参数 = {


        "控制调整": {
            // 打开盒子的时候，要不要弹出鼠标，要就调true，不要就false，不是很推荐，效果一般！！！！
            打开盒子是否弹出鼠标: false,   
            
        },


        "找图设置": {
            盒子: ['一个盒子', 0.75, 4, 4, 3, 1],
            附近: ['一个手', 0.75, 3, 4, 3, 1],

            开门: ['开门', 0.8, 4, 4, 3, 3],       // 操作设置截取

            驾驶: ['驾驶', 0.75, 4, 4, 3, 2],
            乘坐: ['乘坐', 0.75, 4, 4, 3, 3],

            次元箱: ['开启次元箱', 0.75, 4, 3, 3, 2],  // 超体训练截取

            救人: ['救人', 0.85, 3, 1, 2, 1],
            取消投掷: ['取消投掷', 0.75, 4, 3, 1, 2],
            取消: ['取消', 0.8, 3, 2, 2, 2],

            医疗栏展开: ['展开图标', 0.75, 4, 4, 2, 4],
            医疗栏收回: ['收回图标', 0.75, 3, 2, 1, 2],
            医疗箱: ['医疗箱', 0.75, 3, 2, 1, 2],
            急救包: ['急救包', 0.75, 3, 2, 1, 2],
            绷带: ['绷带', 0.75, 3, 2, 1, 2],   // 实战截取
            肾上腺素: ['肾上腺素', 0.75, 3, 2, 1, 2],   //超体训练场 - 次元箱截取
            止痛药: ['止痛药', 0.75, 3, 2, 1, 2],       //超体训练场 - 次元箱截取
            能量饮料: ['能量饮料', 0.75, 3, 2, 1, 2],   //超体训练场 - 次元箱截取

            侦查: ['侦查', 0.75, 3, 3, 3, 3],
            轰炸: ['轰炸', 0.75, 4, 4, 4, 3],
            瞬移: ['瞬移', 0.75, 4, 4, 4, 3],
            次元模式: ['次元模式', 0.75, 4, 4, 3, 1],
            瞬移模式: ['瞬移模式', 0.75, 4, 4, 3, 4],
            轰炸模式: ['轰炸模式', 0.75, 4, 3, 4, 3],
            侦查模式: ['侦查模式', 0.75, 4, 4, 4, 2],

            调距: ['调距', 0.75, 4, 4, 2, 1],
            调距关闭按钮: ['调距关闭按钮', 0.75, 4, 4, 2, 1],

            附近菜单: ['附近菜单', 0.7, 4, 4, 3, 1],
            附近菜单2: ['附近菜单2', 0.7, 4, 4, 3, 1],
            附近菜单3: ['附近菜单3', 0.7, 4, 4, 3, 1],
            附近菜单4: ['附近菜单4', 0.7, 4, 4, 3, 1],

            六格展示: ['六格展示', 0.7, 4, 4, 3, 2],

            下蹲: ['下蹲', 0.8, 4, 4, 4, 4],
            趴下: ['趴下', 0.8, 4, 4, 4, 4],
            地图模式: ['地图模式', 0.75, 4, 4, 4, 4],

            背包模式: ['背包模式', 0.75, 4, 4, 4, 3],
            换位: ['换位', 0.6, 4, 4, 4, 4],
            下车: ['下车', 0.75, 4, 3, 4, 2],
            急刹: ['急刹', 0.75, 4, 4, 4, 3],
            喇叭: ['喇叭', 0.75, 4, 4, 4, 3],
            载具加速: ['载具加速', 0.75, 4, 3, 1, 2],
            单车: ['单车加速', 0.75, 4, 3, 1, 2],   // 单车截取

            上浮: ['上浮', 0.75, 4, 4, 4, 3],
            下潜: ['下潜', 0.75, 4, 4, 4, 4],

            关门: ['关门', 0.75, 4, 4, 3, 3],          // 实战截取
            脱离模式: ['脱离模式', 0.75, 4, 1, 1, 1],   // 实战截取
            跳伞模式: ['跳伞模式', 0.75, 4, 4, 1, 2],   // 实战截取
            下落模式: ['下落模式', 0.75, 4, 3, 4, 3],   // 实战截取
            飞机模式: ['飞机模式', 0.75, 4, 4, 1, 4],   // 实战截取

            地图按钮: ['地图按钮位置', 0.75, 4, 1, 4, 1],


        },

         // 颜色检测位置
        // R,G,B,A,X,Y
        "颜色检测":{
            驾驶中:["255:255:170:55","1336:638"],
            乘坐1:["255:255:170:55","1369:638"],
            乘坐2:["255:255:170:55","1339:667"],
            乘坐3:["255:255:170:55","1368:668"]
        },



    // 基础按键调整

        "切换枪械": {
            // 如果填写了自己手机的分辨率，这几项不需调整！！！！，当然如果你想自定义的话也可以！
            一号切换射击模式_坐标: [1009, 818],
            二号切换射击模式_坐标: [1386, 818],
        },

        "基础操作": {
            // 如果使用了分辨率转换坐标，则无需动他！！！(除非对不上了，你可以轻微挪动一下游戏键位！！,或者手动微调一下下面的坐标值！！！)
            乘坐坐标_坐标: [1700, 588],
        },

        "按键_F": {

            // 如果使用了分辨率转换坐标，则无需动他！！！(除非对不上了，你可以轻微挪动一下游戏键位！！,或者手动微调一下下面的坐标值！！！)
            取消投掷坐标_坐标: [562, 577],
            救人坐标_坐标: [1224, 547],
            门坐标_坐标: [1686, 715],
            驾驶坐标_坐标: [1702, 466],
            取消坐标_坐标: [1234, 704],
            下车_坐标: [1934, 561],
            默认点击位置坐标_坐标: [1705, 465],

            跳伞坐标_坐标: [449, 446],      //实战截取
            开伞坐标_坐标: [2044, 835],     //实战截取
        },

        "超体模式": {

            // 如果使用了分辨率转换坐标，则无需动他！！！(除非对不上了，你可以轻微挪动一下游戏键位！！,或者手动微调一下下面的坐标值！！！)
            瞬移_坐标: [1323, 1022],
            取消瞬移_坐标: [1058, 1024],

            轰炸_坐标: [2188, 856],
            取消轰炸_坐标: [2045, 637],

            关闭次元箱_坐标: [2280, 47],
            退出侦查_坐标: [2141, 384],
        },

    // 检测频率---------------1000ms(毫秒) = 1s(秒)-----------------

        "检测频率": {
            // 模式检测每次的检测时间，数字越小，检测越快，性能消耗越高，数字越大，检测越慢，性能消耗越低。
            模式检测频率: 72,  

            // 模式检测到后，间隔多久打印一次模式，用于Debug！！
            打印模式信息: 8000,      

            // 检测拾取菜单，如盒子菜单中，有附近拾取菜单中，数字越小，检测越快，性能消耗越高，数字越大，检测越慢，性能消耗越低。
            拾取菜单检测: 36,         

            // 实时UI，也就是画面的实时变化速度，检测的频率，数字越小，检测越快，性能消耗越高，数字越大，检测越慢，性能消耗越低。
            实时画面频率: 36,

            拾取循环次数: 2,
        },

}




